docs/modules/publishing/freemacs-spellcheck.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spellcheck Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Spellcheck Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb681a24">1. Ispell</a></li>
<li><a href="#org56bf73b">2. Flyspell</a></li>
<li><a href="#org9777bf7">3. End</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgb681a24" class="outline-2">
<h2 id="orgb681a24"><span class="section-number-2">1.</span> Ispell</h2>
<div class="outline-text-2" id="text-1">
<p>
Ispell is the default spell checking tool in Emacs. In order for spellchecking to work in Windows, hunspell must be installed with the proper dictionaries. I have downloaded hunspell from ezwinports and included it in my <code>~/.emacs.d/</code> directory so that I can also use hunspell when I am using Emacs as a portable app from a USB drive. To use hunspell for spell checking, we must first configure the Ispell package:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">ispell</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:type</span> built-in<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">if</span> <span style="color: #a7da1e;">(</span>eq system-type 'windows-nt<span style="color: #a7da1e;">)</span>
      <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">progn</span> <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-program-name <span style="color: #A875FF;">(</span>expand-file-name <span style="color: #7984D1;">"~/.emacs.d/hunspell/bin/hunspell.exe"</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
             <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-personal-dictionary <span style="color: #7984D1;">"~/.emacs.d/hunspell_en_US"</span><span style="color: #df85ff;">)</span>
             <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-local-dictionary <span style="color: #7984D1;">"en_US"</span><span style="color: #df85ff;">)</span>
             <span style="color: #df85ff;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-local-dictionary-alist
                   '<span style="color: #A875FF;">(</span><span style="color: #1ea8fc;">(</span><span style="color: #7984D1;">"en_US"</span> <span style="color: #7984D1;">"[[:alpha:]]"</span> <span style="color: #7984D1;">"[</span><span style="color: #ff2afc; font-weight: bold;">^</span><span style="color: #7984D1;">[:alpha:]]"</span> <span style="color: #7984D1;">"[']"</span> nil <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"-d"</span> <span style="color: #7984D1;">"en_US"</span><span style="color: #ff2afc;">)</span> nil utf-8<span style="color: #1ea8fc;">)</span><span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> ispell-program-name <span style="color: #df85ff;">(</span>whicher <span style="color: #7984D1;">"hunspell"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org56bf73b" class="outline-2">
<h2 id="org56bf73b"><span class="section-number-2">2.</span> Flyspell</h2>
<div class="outline-text-2" id="text-2">
<p>
Flyspell mode can be hooked to various buffer modes so that spell-checking can be done as typing occurs. As you type, a red wavy line will appear under text that it deems to be incorrectly spelled.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">flyspell</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:type</span> built-in<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>add-hook 'prog-mode-hook 'flyspell-prog-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-hook 'text-mode-hook 'flyspell-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9777bf7" class="outline-2">
<h2 id="org9777bf7"><span class="section-number-2">3.</span> End</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-spellcheck</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-spellcheck.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
